
const questions_data = {
    current_question_id: 0
}

const questions = [
    {
        id: 0,
        text: 'מה היא עיר הבירה של אתיופיה ?',
        answers: ['מוגדישו', 'אדיס אבבה', 'ניירובי', 'קמפאלה'],
        correct_answer: 2
    },
    {
        id: 1,
        text: 'מה היא עיר הבירה של בלגיה ?',
        answers: ['בריסל', 'ברן', 'פראג', 'פוזנן'],
        correct_answer: 1
    },
    {
        id: 2,
        text: 'מה היא עיר הבירה של קרואטיה ?',
        answers: ['ספליט', 'זאגרב', 'סרייבו', 'בלגרד'],
        correct_answer: 1
    },
    {
        id: 3,
        text: 'מה היא עיר הבירה של אוסטרליה ?',
        answers: ['סידני', 'מלבורן', 'קנברה', 'פרתי'],
        correct_answer: 2
    },
    {
        id: 4,
        text: 'מה היא עיר הבירה של ירדן ?',
        answers: ['מדינה', 'עמאן', 'דמשק', 'ביירות'],
        correct_answer: 2
    },
    // {
    //     id: 5,
    //     text: 'במה מפורסמת איסטנבול ?',
    //     answers: ['השתלת שיעור ורפואת שיניים', 'משחקי כדורגל', 'בקלאווה עם חלווה', '( א ו ג ) הם הנכון'],
    //     correct_answer: 4
    // },
    // {
    //     id: 6,
    //     text: 'באיזו שפה מדברת ברזיל ?',
    //     answers: ['השפה הפורטוגזית', 'השפה הארגנטינאי', 'השפה האנגלית', 'השפה הפולני'],
    //     correct_answer: 1
    // },
    // {
    //     id: 7,
    //     text: 'מה הייתה המדינה הראשונה שבה התפשט נגיף הקורונה ?',
    //     answers: ['איטליה', 'הודו', 'ווהאן , סין', 'איסטנבול'],
    //     correct_answer: 3
    // },
    // {
    //     id: 8,
    //     text: 'מה היא המדינה האירופית הגדולה ביותר מבחינת שטח ?',
    //     answers: ['ספרד', 'רוסיה', 'אוקראינה , סין', 'צרפת'],
    //     correct_answer: 2
    // },
    // {
    //     id: 9,
    //     text: 'מה הוא השטח של אוקראינה ?',
    //     answers: ['551,695', '498,468', '3,972,400', '603,628'],
    //     correct_answer: 4
    // },
    // {
    //     id: 10,
    //     text: 'כמה מספר התושבים של גרמניה ?',
    //     answers: ['66 מיליון', '47 מיליון', '83 מיליון', '77 מילון'],
    //     correct_answer: 3
    // },
    // {
    //     id: 11,
    //     text: 'כמה מספר התושבים של טורקיה ?',
    //     answers: ['84 מיליון', '165 מיליון', '92 מיליון', '100 מיליון'],
    //     correct_answer: 1
    // },
    // {
    //     id: 12,
    //     text: 'כמה מספר התושבים של רוסיה ?',
    //     answers: ['130 מיליון', '210 מיליון', '90 מיליון', '144 מיליון'],
    //     correct_answer: 4
    // },
    // {
    //     id: 13,
    //     text: 'כמה מספר התושבים של צרפת ?',
    //     answers: ['50 מיליון', '67 מיליון', '94 מיליון', '55 מיליון'],
    //     correct_answer: 2
    // },
    // {
    //     id: 14,
    //     text: 'כמה מספר התושבים של ארצות הברית ?',
    //     answers: ['202 מיליון', '410 מיליון', '177 מיליון', '329 מיליון'],
    //     correct_answer: 4
    // },
    // {
    //     id: 15,
    //     text: 'מה היא עיר הבירה של פורטוגל ?',
    //     answers: ['פורטו', 'קוימברה', 'מדריד', 'ליסבון'],
    //     correct_answer: 4
    // },
    // {
    //     id: 16,
    //     text: 'באיזה מטבע משתמשים בתאילנד ?',
    //     answers: ['רופי', 'באט', 'קרונה', 'דינר'],
    //     correct_answer: 2
    // },
    // {
    //     id: 17,
    //     text: 'מה היא עיר הבירה של פולין ?',
    //     answers: ['קרקוב', 'ורשה', 'לודג\'', 'סטוקהולם'],
    //     correct_answer: 2
    // },
    // {
    //     id: 18,
    //     text: 'מה היא עיר הבירה של ניו זילנד ?',
    //     answers: ['ואנקה', 'קווינסטאון', 'ולינגטון', 'אוקלנד'],
    //     correct_answer: 3
    // },
    // {
    //     id: 19,
    //     text: 'מה היא עיר הבירה של בולגריה ?',
    //     answers: ['וארנה', 'בורגס', 'בוקרשט', 'סופיה'],
    //     correct_answer: 4
    // },
]

const questions2 = [
    {
        id: 0,
        text: 'מה היא עיר הבירה של קנדה ?',
        answers: ['ונקובר', 'טורונטו', 'מונטריאול', 'אוטווה'],
        correct_answer: 4
    },
]

// Get question data by its id
function get_question_data(_question_id) {
    const data = questions.find(question => {
        return question['id'] === _question_id
    })
    return data
}
